nxp-mcuxpresso/mcux-sdk-examples/frdmk32l3a6/demo_apps/power_mode_switch/cm4/pin_mux.h
/*
 * Copyright 2020 ,2021 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC7 (coord N2), U40[1]/K32L_UART0_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CORE0_DEBUG_UART0_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_DEBUG_UART0_RX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_DEBUG_UART0_RX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PORTC8 (coord P3), U11[1]/K32L_UART0_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CORE0_DEBUG_UART0_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_DEBUG_UART0_TX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_DEBUG_UART0_TX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PORTB20 (coord J1), U15[6]/MEMORY/SPI2_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SCK_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SCK_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SCK_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTB22 (coord L1), U15[1]/MEMORY/SPI2_PCS0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_PCS_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_PCS_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_PCS_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTB21 (coord J2), U15[5]/MEMORY/SPI2_SOUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SOUT_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SOUT_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SOUT_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PORTB24 (coord L2), U15[2]/MEMORY/SPI2_SIN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SIN_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SIN_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_FLASH_SPI1_SIN_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Core0(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
